incompressibleVoF/trayedPipe/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    wall
    {
        type        faceZone;
        zoneName    baffles;

        owner
        {
            name        baffles;
            type        wall;
        }
        neighbour
        {
            $owner;
        }
    }
}


// ************************************************************************* //
